Today faced the issue again:

```none
│ Error: Provider produced inconsistent final plan
│ 
│ When expanding the plan for module.app-admin.aws_instance.instance to
│ include new values learned so far during apply, provider
│ "registry.terraform.io/hashicorp/aws" changed the planned action from
│ Update to DeleteThenCreate.
│ 
│ This is a bug in the provider, which should be reported in the provider's
│ own issue tracker.
...
```

A lot of messages on the `aws_instance` resource.

The following changes for the instance were in the plan:

```none
  # module.app-admin.aws_instance.instance will be updated in-place
  ~ resource "aws_instance" "instance" {
        id                                   = "i-01e9cfa7850822efb"
        tags                                 = {
            "cost:env" = "review"
        }
      ~ user_data=(sensitive)
        # (32 unchanged attributes hidden)
        # (7 unchanged blocks hidden)
    }
```

This change makes the instance to be stopped and started again. 

On the next run without changes in the configuration, it works well but the plan for the instance is different:

```none
  # module.app-admin.aws_instance.instance must be replaced
+/- resource "aws_instance" "instance" {
      ~ arn                                  = "arn:aws:ec2:ap-northeast-1:acc:instance/i-09db6d84907737075" -> (known after apply)
      ~ availability_zone                    = "ap-northeast-1a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-09db6d84907737075" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key=(sensitive)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password=(sensitive)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-02122ec8dfc3c8a17" -> (known after apply)
      ~ private_dns                          = "ip-10-0-2-38.ap-northeast-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.0.2.38" -> (known after apply)
      ~ public_dns                           = "ec2-54-178-14-179.ap-northeast-1.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.178.14.179" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "cost:env" = "review"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data=(sensitive)
      ~ user_data=(sensitive)
        # (10 unchanged attributes hidden)
      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)
          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }
      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key=(sensitive)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }
      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }
      ~ maintenance_options {
          ~ auto_recovery = "default" -> (known after apply)
        }
      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_token=(sensitive)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }
      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }
      ~ private_dns_name_options {
          ~ enable_resource_name_dns_a_record    = false -> (known after apply)
          ~ enable_resource_name_dns_aaaa_record = false -> (known after apply)
          ~ hostname_type                        = "ip-name" -> (known after apply)
        }
      ~ root_block_device {
          ~ delete_on_termination = true -> (known after apply)
          ~ device_name           = "/dev/xvda" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 100 -> (known after apply)
          + kms_key=(sensitive)
          ~ tags                  = {} -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "vol-03b07ff84ffdd1b1f" -> (known after apply)
          ~ volume_size           = 8 -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
        }
        # (1 unchanged block hidden)
    }
```

On the second run, the log again contains the following lines:

```none
module.app-admin.aws_instance.instance: Creating...
module.app-admin.aws_instance.instance: Still creating... [10s elapsed]
module.app-admin.aws_instance.instance: Creation complete after 12s [id=i-0f8a52b7fab32b38c]
```

Again, there were NO log lines about the instance stopping or destruction on both runs. I again suppose that the issue is that the provider misses the actual resource due to #20651 or any other reason (i.e. already deleted). 
